drama-explorer/app/views/actors/show.html.erb

SELECT "dramas".* FROM "dramas" INNER JOIN "participations" ON "dramas"."id" = "participations"."drama_id" WHERE "participations"."actor_id" = $1  [["actor_id", 28]]
---

<% @actor.dramas.each do |drama| %>