drama-explorer/app/views/dramas/show.html.erb

SELECT "actors".* FROM "actors" INNER JOIN "participations" ON "actors"."id" = "participations"."actor_id" WHERE "participations"."drama_id" = $1  [["drama_id", 3]]
---
<div class="row drama-show-row" style="padding-bottom:0px;">
	<% @drama.actors.each do |actor| %>

SELECT "participations".* FROM "participations" WHERE "participations"."drama_id" = $1  [["drama_id", 14]]
---
					<% if is_admin %>
						<%= link_to '削除', participation_path(@drama.find_participation(actor)),
								method: :delete, data: { confirm: '削除しますか？' } %>

SELECT "seasons".* FROM "seasons" WHERE "seasons"."drama_id" = $1  [["drama_id", 3]]
---
		<table id="season-list" class="table">
			<% @drama.seasons.sort.each do |season| %>

SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = $1  [["season_id", 63]]
---
					<h5>Season <strong><%= season.season_num %></strong></h5>
					<% season.episodes.sort.each do |episode| %>