drama-explorer/app/views/participations/new.html.erb

SELECT "dramas".* FROM "dramas"
---
        <div class="col-3">
            <%= form.label 'Drama ' %><br><%= form.select :drama_id,
                options_for_select(Drama.all.map{|s|[s.title, s.id]}, @drama.id) %>

SELECT "actors".* FROM "actors"
---
        <div class="col-3">
            <%= form.label 'Actor ' %><br><%= form.select :actor_id, options_for_select(Actor.all.map{|s|[s.name, s.id]}) %>