app/controllers/episodes_controller.rb

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 155], ["LIMIT", 1]]
---
	def show
		@episode = Episode.find(params[:id])