app/controllers/seasons_controller.rb

	def new
		@drama = Drama.find(params[:drama_id])
---
SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

	def edit
		@season = Season.find(params[:id])
---
SELECT  "seasons".* FROM "seasons" WHERE "seasons"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]

	def create
		#render plain: params[:season].inspect

		@drama = Drama.find(params[:drama_id])
		@season = @drama.seasons.build(season_params)

		1.upto(season_params[:num_total_episode].to_i) do |num|
			episode_params = { episode_num: num }
			episode = @season.episodes.build(episode_params)
		end

		if @season.save
---
SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "episodes" ("episode_num", "season_id", "created_at", "updated_at", "filename") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["episode_num", 1], ["season_id", 65], ["created_at", "2018-04-07 01:03:19.391361"], ["updated_at", "2018-04-07 01:03:19.391361"], ["filename", "dd01.mp4"]]
INSERT INTO "seasons" ("season_num", "created_at", "updated_at", "drama_id", "url_prefix", "num_total_episode") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["season_num", 1], ["created_at", "2018-04-07 01:03:19.388167"], ["updated_at", "2018-04-07 01:03:19.388167"], ["drama_id", 16], ["url_prefix", "dd"], ["num_total_episode", "16.0"]]

	def update
		@season = Season.find(params[:id])

		if @season.update(season_params)
---
SELECT  "seasons".* FROM "seasons" WHERE "seasons"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
UPDATE "seasons" SET "url_prefix" = $1, "updated_at" = $2 WHERE "seasons"."id" = $3  [["url_prefix", "https://s3.ap-northeast-2.amazonaws.com/calvin-drama-explorer/dokebi-"], ["updated_at", "2018-04-03 10:06:17.155788"], ["id", 64]]

	def destroy
		@season = Season.find(params[:id])
		belonged_drama = @season.drama
		@season.destroy
---
SELECT  "seasons".* FROM "seasons" WHERE "seasons"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
DELETE FROM "seasons" WHERE "seasons"."id" = $1  [["id", 52]]