drama-explorer/app/controllers/actors_controller.rb

    def index
        @actors = Actor.all
---
SELECT "actors".* FROM "actors"

    def edit
        @actor = Actor.find(params[:id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

    def show
        @actor = Actor.find(params[:id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

    def create
        #render plain: params[:actor].inspect

        @actor = Actor.new(actor_params)
        if @actor.save
---
INSERT INTO "actors" ("name", "created_at", "updated_at", "birthdate", "spouse", "company", "height", "blood", "weight", "eng_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
        @actor = Actor.find(params[:id])

        if @actor.update(actor_params)
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "actors" SET "birthdate" = $1, "weight" = $2, "blood" = $3, "spouse" = $4, "company" = $5, "updated_at" = $6 WHERE "actors"."id" = $7  [["birthdate", "1979-07-10"], ["weight", ""], ["blood", ""], ["spouse", ""], ["company", ""], ["updated_at", "2018-04-04 03:49:54.665434"], ["id", 7]]