drama-explorer/app/controllers/dramas_controller.rb

SELECT "dramas".* FROM "dramas"
---
	def index
		@dramas = Drama.all

SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@drama = Drama.find(params[:id])

SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def show
		@drama = Drama.find(params[:id])

INSERT INTO "dramas" ("title", "genre", "director", "actor", "created_at", "updated_at", "synopsis", "eng_title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		#render plain: params[:drama].inspect
		@drama = Drama.new(drama_params)

		if @drama.save

SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "dramas" SET "actor" = $1, "synopsis" = $2, "updated_at" = $3 WHERE "dramas"."id" = $4  [["actor", "櫻井翔、蒼井優、多部未華子、瀬戸康史、木南晴夏、井川遥"], ["synopsis", "営業社員が出向で校長先生になってしまう話"], ["updated_at", "2018-04-20 11:01:55.236037"], ["id", 14]]
---
	def update
		@drama = Drama.find(params[:id])

		if @drama.update(drama_params)

SELECT  "dramas".* FROM "dramas" WHERE "dramas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "dramas" WHERE "dramas"."id" = $1  [["id", 3]]
---
	def destroy
		@drama = Drama.find(params[:id])
		@drama.destroy